[
  {
    "id": "task-002",
    "title": "Enhance scraping process with timeout and fallback mechanism",
    "description": "Improve the content scraping process to increase timeout settings and implement fallback strategy when AgentQL fails",
    "context": "Current scraping process is located in src/services/content/agentql.service.ts. When AgentQL fails directly on a URL, it should fallback to first get the HTML content, then call AgentQL with the HTML instead of the direct URL. This will improve reliability and handle edge cases better. Need to increase timeout values and add proper error handling.",
    "priority": "high",
    "status": "completed",
    "assignedTo": null,
    "tags": ["reliability", "error-handling", "scraping", "fallback"],
    "dependencies": [],
    "subtasks": [],
    "estimatedHours": 0,
    "actualHours": 0,
    "createdAt": "2025-08-06T00:00:00.000Z",
    "updatedAt": "2025-08-07T14:30:00.000Z",
    "completedAt": "2025-08-07T14:30:00.000Z",
    "dueDate": null,
    "notes": [
      "Started implementation in content-aggregation.service.ts. Found existing fallback mechanism that needs enhancement.",
      "Enhanced timeout values: AgentQL timeout increased from 30s to 60s, wait time from 2s to 3s",
      "Improved fallback mechanism with proper empty content detection",
      "Added retry capability (2 retries) with enhanced logging and performance metrics",
      "Implementation completed in both agentql.service.ts and content-aggregation.service.ts"
    ]
  },
  {
    "id": "task-003",
    "title": "Reject links without RSS feeds and update frontend messaging",
    "description": "Implement validation to reject user-submitted links that don't have RSS feeds, and add frontend messaging to inform users about RSS requirement",
    "context": "Users should not be able to add links without RSS feeds for now (future support planned). Modified LinksService.processLink() to validate RSS feed existence using RSSService.findFeedUrls(). When no RSS feed is found, returns HTTP 400 error with clear message. Updated Swagger documentation in LinksController to document the new validation error responses.",
    "priority": "medium",
    "status": "completed",
    "assignedTo": null,
    "tags": ["validation", "rss", "backend", "user-experience", "error-handling"],
    "dependencies": [],
    "subtasks": [],
    "estimatedHours": 0,
    "actualHours": 0,
    "createdAt": "2025-08-06T00:00:00.000Z",
    "updatedAt": "2025-08-07T15:00:00.000Z",
    "completedAt": "2025-08-07T15:00:00.000Z",
    "dueDate": null,
    "notes": [
      "Implemented RSS validation in LinksService.processLink()",
      "Added error handling with message: 'No RSS feed found for this URL. We currently only accept blogs with public RSS feeds.'",
      "Updated Swagger documentation for POST /links with detailed 400 error examples",
      "Removed frontend requirement as this is backend-only application"
    ]
  },
  {
    "id": "task-004",
    "title": "Mark post as read when expanded successfully",
    "description": "Implement functionality to automatically mark posts as read when users expand them and the expansion completes successfully",
    "context": "Modified PostsService.expandPost() method to automatically call markAsRead() after successful content expansion. Implementation uses non-blocking approach to avoid delaying expansion response. The markAsRead() call is placed after createExpandedContent() succeeds but before the final response.",
    "priority": "medium",
    "status": "completed",
    "assignedTo": null,
    "tags": ["user-experience", "post-management", "read-status", "expansion", "database"],
    "dependencies": [],
    "subtasks": [],
    "estimatedHours": 0,
    "actualHours": 0,
    "createdAt": "2025-08-07T00:00:00.000Z",
    "updatedAt": "2025-08-07T15:00:00.000Z",
    "completedAt": "2025-08-07T15:00:00.000Z",
    "dueDate": null,
    "notes": [
      "Implemented non-blocking markAsRead() call in PostsService.expandPost()",
      "Positioned after successful content creation, before finalizing response",
      "No await used to prevent delays in expansion process",
      "Posts are now automatically marked as read when expansion succeeds"
    ]
  },
  {
    "id": "task-005",
    "title": "Add incremental ID to posts and update ordering logic",
    "description": "Implement an incremental integer ID field for posts and modify the ordering system to depend on this sequential ID instead of UUIDs or timestamps",
    "context": "Currently posts use UUID as primary key which doesn't provide natural ordering. Based on the current Post entity in src/entities/post.entity.ts extending BaseEntity with UUID id, we need to add an auto-incrementing integer field (like post_number or sequence_id) to ensure proper chronological ordering of posts. The current PostModel in src/models/post.model.ts orders by 'created_at DESC', but this should be updated to use the incremental ID for more reliable ordering. This involves: 1. Database migration to add incremental ID column to Post entity, 2. Update Post entity to include the new auto-increment field, 3. Modify PostModel.findAll() ordering logic to use incremental ID instead of created_at, 4. Update PostsService ordering logic if needed, 5. Consider impact on existing API responses and ensure backward compatibility, 6. The incremental ID should auto-increment on insert and be used as the primary ordering mechanism for displaying posts in chronological order (newest first typically). Current architecture uses TypeORM with PostgreSQL database and follows modular entity-service-controller pattern.",
    "priority": "medium",
    "status": "completed",
    "assignedTo": null,
    "tags": ["database", "migration", "ordering", "entity", "post-management", "incremental-id"],
    "dependencies": [],
    "subtasks": [],
    "estimatedHours": 0,
    "actualHours": 0,
    "createdAt": "2025-08-07T00:00:00.000Z",
    "updatedAt": "2025-08-07T16:00:00.000Z",
    "completedAt": "2025-08-07T16:00:00.000Z",
    "dueDate": null,
    "notes": [
      "Created database migration 1920000000000-AddIncrementalIdToPosts.ts to add sequence_id column with SERIAL type and unique index",
      "Updated Post entity in src/entities/post.entity.ts to include sequence_id field with @Generated('increment') decorator and proper indexing",
      "Modified PostModel.findAll() ordering logic in src/models/post.model.ts to order by sequence_id DESC instead of created_at DESC",
      "Updated Swagger documentation for GET /posts to describe the new ordering system",
      "Maintained backward compatibility with existing API responses while improving internal ordering mechanism",
      "Implementation provides reliable chronological ordering using auto-incrementing sequence ID with better performance and consistent ordering regardless of timestamp precision issues"
    ]
  }
]